Управление_пожарной_частью_/src/Documents/Выдача/Выдача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Выдача</name>
  <registerRecords>AccumulationRegister.ОстаткиИмуществаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСотрудника</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/Выдача/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВещевоеИмуществоНаименованиеПриИзменении(Элемент, Строка)
    
    // Получаем индекс текущей строки
    Индекс = Элементы.ВещевоеИмущество.ТекущиеДанные.НомерСтроки - 1;
    
    // Вызываем серверный метод
    РассчитатьДатуСписанияНаСервере(Индекс);
    
КонецПроцедуры

&НаСервере
Процедура РассчитатьДатуСписанияНаСервере(Индекс)
    
    // Получаем строку по индексу
    СтрокаТЧ = Объект.ВещевоеИмущество[Индекс];
    
    Если СтрокаТЧ.Наименование = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // ПРЯМОЕ ОБРАЩЕНИЕ К РЕКВИЗИТУ СПРАВОЧНИКА
    // (работает, если Наименование - ссылка на справочник)
    СрокМесяцев = СтрокаТЧ.Наименование.СрокИспользования;
    
    Если СрокМесяцев > 0 Тогда
        СтрокаТЧ.ДатаСписания = ДобавитьМесяц(Объект.Дата, СрокМесяцев);
    КонецЕсли;
    
КонецПроцедуры
